#!/bin/bash

# Функція для виведення об'єму зайнятого дискового простору папок та файлів в порядку спадання
get_disk_usage() {
    directory="$1"
    # Використовуємо команду 'du' для визначення об'єму зайнятого дискового простору папок та файлів
    # Сортуємо результат за об'ємом у порядку спадання та обмежуємо до перших 10 записів
    du -ab "$directory" | sort -nr | head -n 10
}

: <<COMENT
# Перевірка наявності аргументів у командному рядку
if [ $# -eq 0 ]; then
    echo "Потрібно вказати принаймні одну директорію"
    exit 1
fi

# Викликаємо функцію для переданих директорій
for dir in "$@"; do
    echo "Директорія $dir:"
    get_disk_usage "$dir"
done
COMENT


#: <<COMENT
# Викликаємо функцію для директорії /home та виводимо результат
echo " "
echo "Директорія /home:"
get_disk_usage "/home"

# Викликаємо функцію для директорії /var/log та виводимо результат
echo " "
echo "Директорія /var/log:"
get_disk_usage "/var/log"

#COMENT
