#Перевіряємо, чи задали 2 аргументи
if [ $# -ne 2 ]; then
   echo "Помилка: Має бути вказано 2 аргумента: шлях папки звідки вирізаються файли і шлях куди вставляються"
   exit 1
fi

cd
copyFileWith="$1"
pasteFileTo="$2"

#Перевіряємо вказані у терміналі шляхи
if [ ! -d "$copyFileWith" ]; then
   echo "Помилка: Папка з якої ви хочете копіювати не існує."
   exit 1
fi

if [ ! -d "$pasteFileTo" ]; then
   mkdir -p "$pasteFileTo"
   echo "Увага: Папка в яку ви хотіли скопіювати - не існувала. Створена нова папка за вказаним шляхом"
fi

cp -r "$copyFileWith"/* "$pasteFileTo"
echo "Якщо до не виникло помилок, то файли були успішно скопійовані."
